<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Arabic Messages
    |--------------------------------------------------------------------------
    */
    'invalid_id'                      => 'رقم معرف غير صالح',
    'can_not_cancel_vacation_request' => 'يمكن إلغاء طلب الإجازة فقط عندما يكون في حالة الاقتراح',
    'vacation_cancel'                 => 'تم إلغاء طلب الإجازة بنجاح',
    'not_valid_cutting_at'            => [
        'normal' => 'يرجى التأكد من أن تاريخ قطع الإجازة يقع ضمن فترة الإجازة',
        'cut'    => 'يرجى التأكد من أن تاريخ قطع الإجازة يقع بين تاريخ بداية الإجازة وتاريخ قطع الإجازة السابق',
    ],
    'not_percent_value'               => 'يجب أن تكون القيمة نسبة مئوية',
    'vacation_not_accepted'           => 'هذه الإجازة غير مقبولة',
    'no_approval_levels'              => 'هذه الإجازة لا تحتوي على هرمية قبول. رجاءاً قم بإضافة هرمية',
    'already_take_action'             => 'تم أخذ قرار بالفعل',
    'vacation_already_extend'         => 'هذه الإجازة تمتلك طلب تمديد مسبق لها',
    'has_days'                        => 'لم يعد لديك ايام متبقية في هذه الاجازة',
    'has_series_days'                 => 'تم تجاوز عدد الايام المتتالية المسموحة',
    'can_not_cutting_vacation'        => 'لا يمكنك قطع هذه الإجازة لأنها ليست مقبولة بعد',
    'penalty_value_percentage'        => 'حقل القيمة يجب ان يكون بين 1و100',
    'unique_error'                    => 'لا تستطيع تكرار البيانات',
    'report_creation_failed'          => "Unable to find the salary for the specified month.",
    'no_token'                        => 'لا يوجد معرف دخول Token',
    'cant_update_vacation_request'    => 'يمكن تعديل طلبات الإجازة فقط عندما تكون في حالة الاقتراح',
    'invalid_update_vacation_request' => "تعذر تحديث طلب الإجازة: البيانات المقدمة تتجاوز الحد المسموح به لهذا النوع من الإجازات",
    'hourly_vacation_only'            => "هذه الخدمة غير مناسبة لإجازة عادية؛ إنما تصلح للإجازات الساعية",
    'stopped_vacation'                => "لا يمكنك قطع اجازة منتهية",
    'cutting_vacation'                => 'هذه الاجازة مقطوعة',
    'already_has_passport'            => 'ًهذا الموظف يمتلك جواز سفر مسبقا',

];
